app/controllers/api/v1/article_preview_controller.rb

  def index
    articles = Article.all.order(updated_at: "DESC")    # 更新日順に並び替え
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC