app/controllers/api/v1/articles_controller.rb

    def index
      articles = Article.all.order(updated_at: "DESC")    # 更新日順に並び替え
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC

    def show
      article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 177], ["LIMIT", 1]]

    def create
      @current_user = User.find(params[:article][:user_id])
      article = @current_user.articles.new(article_params)

      article.save!
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 304]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 336], ["LIMIT", 1]]
INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test3"], ["body", "test3"], ["created_at", "2023-08-19 16:02:51.982170"], ["updated_at", "2023-08-19 16:02:51.982170"]]

    def update
      article = current_user.articles.find(params[:id])
      article.update!(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 42], ["id", 35], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "update_title"], ["body", "update_body"], ["updated_at", "2023-10-20 13:36:15.631974"], ["id", 5]]

    def destroy
      article = current_user.articles.find(params[:id])
      article.destroy!
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 151], ["id", 148], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 148]]