app/controllers/api/v1/articles_controller.rb

    def create
      @current_user = User.find(params[:article][:user_id])
      article = @current_user.articles.new(article_params)

      article.save!
---
INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test2"], ["body", "test2"], ["created_at", "2023-08-19 16:02:51.894979"], ["updated_at", "2023-08-19 16:02:51.894979"]]