app/controllers/api/v1/base_api_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC
---
  def index
    articles = Article.all.order(updated_at: "DESC")    # 更新日順に並び替え